---
kind: method
id: M:Autodesk.Revit.DB.Electrical.TemperatureRatingTypeSet.ForwardIterator
source: html/2a2b32f1-14d8-bc11-8c87-bc453cd3cbcf.htm
---
# Autodesk.Revit.DB.Electrical.TemperatureRatingTypeSet.ForwardIterator Method

Retrieve a forward moving iterator to the set.

## Syntax (C#)
```csharp
public virtual TemperatureRatingTypeSetIterator ForwardIterator()
```

## Returns
Returns a forward moving iterator to the set.